app/helpers/authentication_helper.rb

    def current_user
        @current_user ||= User.find_by id: session[:user_id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 48], ["LIMIT", 1]]