app/controllers/categories_controller.rb

  def create
    @category = Category.new(categories_params)
    if @category.save
---
INSERT INTO "categories" ("name", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Phụ kiện"], ["status", true], ["created_at", "2021-11-15 05:35:04.582944"], ["updated_at", "2021-11-15 05:35:04.582944"]]

  def edit
    @category = Category.find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]

  def update
    @category = Category.find(params[:id])

    if @category.update(categories_params)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
UPDATE "categories" SET "status" = $1, "updated_at" = $2 WHERE "categories"."id" = $3  [["status", false], ["updated_at", "2021-11-15 05:35:09.739104"], ["id", 18]]

  def destroy
    @category = Category.find(params[:id])
    @category.destroy
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
DELETE FROM "categories" WHERE "categories"."id" = $1  [["id", 17]]