app/controllers/discounts_controller.rb

    def index
        @discounts = Discount.all
---
SELECT "discounts".* FROM "discounts"

    def create
        @discount = Discount.new(discounts_params)
        if @discount.save
---
INSERT INTO "discounts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2021-12-08 16:21:05.441375"], ["updated_at", "2021-12-08 16:21:05.441375"]]

    def edit
        @discount = Discount.find(params[:id])
---
SELECT "discounts".* FROM "discounts" WHERE "discounts"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

    def update
        @discount = Discount.find(params[:id])
        if @discount.update(discounts_params)
---
SELECT "discounts".* FROM "discounts" WHERE "discounts"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "discounts" SET "percent" = $1, "updated_at" = $2 WHERE "discounts"."id" = $3  [["percent", "25.0"], ["updated_at", "2021-12-08 16:28:33.369715"], ["id", 9]]

    def destroy
        @discount = Discount.find(params[:id])
        if @discount.destroy
---
SELECT "discounts".* FROM "discounts" WHERE "discounts"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "discounts" WHERE "discounts"."id" = $1  [["id", 8]]