app/controllers/frontend_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "full_name", "phone", "address", "role") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    @user.admin = false
    if @user.save