app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (status = true)
---
    def index
        @products = Product.all

INSERT INTO "products" ("category_id", "name", "price", "status", "quantity", "discount_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
        @product = Product.new(products_params)
        if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @product = Product.find(params[:id])

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]
UPDATE "products" SET "category_id" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["category_id", 26], ["updated_at", "2021-12-08 03:00:36.703397"], ["id", 32]]
---
    def update
        @product = Product.find(params[:id])

        if @product.update(products_params)

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 31]]
---
    def destroy
        @product = Product.find(params[:id])
        @product.destroy

SELECT "categories".* FROM "categories" WHERE (status)
---
    def set_category
        @category = Category.where('status', true)

SELECT "discounts".* FROM "discounts"
---
    def set_discount
        @discount = Discount.all