app/controllers/users_controller.rb

  def show
    @customers = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 44], ["LIMIT", 1]]