app/controllers/users_controller.rb

  def show
    @customers = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]

  def create
    @user = User.new(user_params)
    @user.admin = true
    if @user.save
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "full_name", "phone", "address", "role") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    if @user.update(update_params)
---
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$12$LwvCKRtIat7n5VKF0EG/8O5k9d3y/r3cQ5fo8.FbtMcyjRD8pDoMK"], ["updated_at", "2021-12-01 04:18:51.888592"], ["id", 44]]

  def updatepassword
    if @user.update(change_password)
---
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$12$l1hcXgvoq3RgYxscn9Zqiu4m3p4IoP.B8xOJNY1sF7Br28UYb5Tu2"], ["updated_at", "2021-12-01 08:07:20.794953"], ["id", 44]]

  def set_find_id
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 44], ["LIMIT", 1]]